export const rulesText = `<title>Saikiong Rodus
Правила игры
(4-я редакция)
Предисловие</title>
Сайкйонг Родус - настольная стратегия с элементами фэнтези. Игра
предусматривает игру 2 или 4 игроков. Процесс игры разделен на партии, каждая
из которых может длиться от 30 минут до нескольких часов. Далее вы узнаете всё
необходимое о текущей версии игры, чтобы самостоятельно погрузиться в
увлекательный мир Сайкйонг Родус.
<title>Начало игры</title>
Игра в Сайкйонг Родус называется «партия». В стандартной партии Сайкйонг Родус
принимает участие два игрока. Они в свою очередь управляют объектами на поле,
которые именуются «персонаж», «постройка», «предмет» и «существо». Цикл из
поочерёдного выполнения двумя игроками действий персонажами или
взаимодействие с картой, называется ход. Таким образом, когда оба игрока
выполнили свои действия, ход партии +1. В распоряжении каждого игрока имеется
5 уникальных персонажей. Подробнее о карточках персонажей мы расскажем в
разделе «Персонажи». Эти персонажи перемещаются и могут атаковать либо
использовать действия. Также иногда, вместо персонажей, действия можно
выполнять «призываемыми существами». Ниже будет представлена
последовательность действий, которая проводится перед каждой официальной
(читать раздел «Судейство») партией в Сайкйонг Родус:
1. Игроки выбирают, на какой из доступных для официальной партии карт им
сыграть.
2. В начале каждой партии, каждый игрок выбирает себе по 5 уникальных
персонажей случайным образом (читать раздел «Судейство»).
3. Игроки решают, на какой из сторон они будут играть (в Саййонг Родус это имеет
значение).
4. Игроки выставляют своих персонажей вокруг построек «База» (подробнее в
следующем разделе)
5. Игроки или судья решают, кто будет ходить первым.
6. Партия начинается.
В этом разделе, мы также перечислим самые основные правила игры, без которых,
надо полагать, игру не получится даже начать:
● Один полный цикл ходов (как уже было сказано выше) складывается из
поочередных ходов всех игроков.
● В один ход, игрок может выполнить персонажами 1 действие и 1 перемещение.
Таким образом, игрок может походить и действовать одним персонажем, или
переместиться одним, а действовать другим персонажем.
● Игрок может переместить своего персонажа, отталкиваясь от суммарного
значения ловкости персонажа, указанного на карточке персонажа (читать раздел
«Бой») и бонусов предметов и/или способностей, дающих бонус к ловкости.
● Персонаж может двигаться строго в 4 направлениях, тратя 1 ловкость на 1
пустую клетку. Движение по диагонали невозможно. Также персонаж, не может
проходить сквозь постройки и других персонажей, если такая возможность не
описана.
● Действие выполняется в доступном радиусе равном «дальности» персонажа,
указанного на карточке персонажа. Таким действием может быть: Обычная атака;
Использование способности (подробнее в разделе «Способности»); Покупка
предмета в магазине; Выкладывание или поднятие предмета; Бросок; Прочее
взаимодействие с постройкой или существом.
● Нельзя атаковать сквозь персонажа и постройки (если у них нет такой
особенности).
● Способности, наносящие урон по области не наносят урон постройкам, а только
существам и персонажам.
● Персонаж может использовать способность, только если она «заряжена» (читать
раздел «Способности»). Большинство способностей заряжены с начала игры.
● Перемещение не может выполняться и до и после действия. За один ход оно
выполняется один раз полностью.
● При покупке в «Оружейной» или «Лаборатории» предмета для персонажа,
купившего предмет, этот магазин уйдёт в перезарядку на 6 следующих ходов. Не
распространяется на «Магический магазин».
● Игра продолжается пока НР одной из баз не достигнет нуля, или же пока все
персонажи одной из команд не будут убиты (подробнее читать в разделе «Бой»).
Теперь когда вы немного разобрались, читайте правила внимательно. Дальше мы
будем детально разбирать процесс партии.
<title>Игровое поле</title>
	 Игровое пространство состоит из клеток (40 х 28). Посередине, оно
разделено пунктирной линией. Эта линия разделяет союзную и вражескую
территории. В разделе «Строительство» такое разделение сыграет важную роль.
Каждая из двух половин карты симметричны и имеют практически одинаковые
постройки.  
	 Самая главная из таких построек – база. На двух половинах, расположены
красная и синяя базы. База является союзной постройкой. Её НР (очки здоровья) –
1500. Будьте осторожны, если показатель НР вашей базы дойдет до нуля, вы
проиграете. Ваши основные задачи в партии: Защитить свою базу от противников;
Разрушить вражескую базу.
	 Вокруг базы в радиусе одной клетки расположен «красный квадрат». Этот
квадрат обозначает зону для выставления персонажей в начале партии.
<subtitle>Что важно знать о «красном квадрате»:</subtitle>
● Эффекты каких-либо построек не могут затрагивать эту зону (читать раздел
«Строительство»).
● Способности с методом «телепортация» не могут ставить конечной целью клетки
в зоне «красного квадрата».
 
Также по сторонам базы расположены несколько зелёных зон. Это «зоны лечения».
Данные участки позволяют союзным персонажам и союзным существам
восстанавливать своё НР в зоне союзной базы.
<subtitle>Что важно знать о «зоне лечения»:</subtitle>
● Зона лечения восстанавливает 25 НР/ход каждому союзному персонажу,
находящемуся в зоне, в соответствии с «правилами подсчета характеристик»
(читать раздел «Бой»).
● Зона лечения ограничивается только зелёными участками и не распространяется
на стены, прилегающие к ней.
● Зона не сбрасывает негативные эффекты (читать раздел «Способности»), а
только восстанавливает НР.

На расстоянии двух клеток от «зоны лечения» расположен «синий квадрат». Внутри
этого квадрата запрещено возводить постройки любого типа, кроме исключений в
виде «Громоотвода».  
<subtitle>Что важно знать о «синем квадрате»:</subtitle>
● Хотя внутри «синего квадрата» запрещено возводить постройки, их эффекты
могут заходить на его территорию.
Далее мы поговорим о постройках на карте.
<subtitle>Храмы.</subtitle>
Храм – это уникальная союзная постройка. Она расположена неподалёку от
«Оружейной» и «Лаборатории».
Что важно знать о храмах:
● Храмы имеют «принадлежность». Изначально храм принадлежит команде, на
территории которой расположен. Таким образом, храм на территории красной
команды – красный храм.
● Храм союзная постройка для команды, которой принадлежит храм. Так для
красной команды, красный храм – союзная постройка.
● Храм восстанавливает союзникам 250 маны/ход, как если бы он молился за
благословение команды-покровителя. Мана восстанавливается в соответствии с
«правилами подсчёта характеристик» (читать раздел «Бой»).
● Чтобы получить благословение храма, персонажу необходимо встать на зелёный
крест, находящийся на соседней от храма клетке.
● Противник не сможет получить ману из союзного храма.
● Персонаж может изменить «принадлежность» храма на свою команду,  
если простоит 3 хода подряд на зелёном кресте (в это время он не будет  
получать ману).
● Хотя храм может быть как союзной, так и вражеской постройкой, ему  
невозможно нанести урон эффектами или другими постройками. Также у  
храмов нет НР.
● Нельзя ставить постройки, своей областью затрагивающие зелёный  
крест.
 
<subtitle>Порталы.</subtitle>
Порталы – нейтральные постройки расположенные симметрично по обе стороны
поля.  
Что важно знать о порталах:
● Порталы объединены связками. Так, на красной половине поля есть синяя связка
порталов, а на синей половине – красная.
● Порталы позволяют перемещаться между двумя порталами одной связки.
● Перемещение между порталами происходит настолько быстро, что не считается
перемещением вовсе и не требует ловкости для выполнения. Это также значит,
что вы можете переместиться, выполнить действие, а потом переместиться через
портал.
● Через портал можно пройти и не переместиться. Дело в том, что портал
расположен на высоте 0 (читать раздел «Бой»).
● Если как-либо заблокировать один портал из связки, другой портал будет
недоступен для перемещения.
<subtitle>Магазины.</subtitle>
Магазины – это уникальные нейтральные постройки, расположенные по сторонам
карты.  
Что важно знать о магазинах:
● Магазины позволяют игрокам покупать предметы, используя в качестве валюты
свою ману.
● Покупка возможна, только если в инвентаре покупателя есть свободное место.
● За один заход в магазин можно купить только один товар.
● Заход в магазин не является действием (пока персонаж не купил товар,  
он может сколько угодно раз за ход смотреть в магазин).
● Есть возможность совместной покупки товара:  
o Мана всех союзников стоящих на соседних от магазина клетках
суммируется и образует баланс.
 
o При покупке товара, «сдача» маны распределяется между всеми
персонажами в магазине как будет угодно игроку. Например, Саламандра (мана:
3500) и Юань-Ти (мана: 2000) зашли в Оружейную, чтобы купить «Башню лучников»
(4000 маны). Их показатели маны образуют общий баланс (мана: 5500). После
покупки товара, Башня лучников отправляется Саламандре или Юань-Ти. А сдача
маны (1500 маны) распределяется между этими двумя персонажами как угодно
игроку. Например, 1000 для Юань-Ти и 500 для Саламандры.
 
o После совместной покупки, магазин перезагружается для всех союзных
персонажей, мана которых применялась при покупке.
 
o Как работает покупка усиления урона. Допустим Юань-Ти и Саламандра
снова решили зайти в «Оружейную». На этот раз, они решили купить усиление
урона. Допустим, у Юань-Ти 1500 маны, а у Саламандры 500 маны. При входе в
магазин, их общий баланс = 2000 маны. Цена усиления урона Саламандре – вся
мана (2000 маны для Саламандры). Таким образом, этого числа как раз хватает для
усиления урона Саламандре.
● Эффекты построек могут затрагивать соседние от магазинов клетки, Однако
суммарное количество перекрытых союзными постройками соседних клеток
одного магазина не должно превышать 4. Так же и с постройкой стен (подробнее
в разделе «Строительство»).
● Также, возле двух баз расположены нейтральные постройки «Магический
магазин»:  
o Магический магазин использует золото вместо маны в качестве валюты
(читать раздел «Бой»).
o Правила блокировки соседних клеток от магического магазина аналогичны
правилам «Оружейной» и «Лаборатории».
o Магический магазин не уходит в перезарядку после покупки.
 
o В магическом магазине за один раз можно купить сколько угодно товаров.
<subtitle>Стены.</subtitle>
Стены – это нейтральные постройки высотой в 1 блок (читать раздел «Бой»).
Различают покупные стены и начальные.Покупные стены,как следует из названия,
могут быть куплены в «Оружейной».Начальные стены уже расставлены
определенным образом на карте.
Что важно знать о стенах:
● Стены нейтральная постройка.Никакие области и эффекты построек не могут
наносить урон стенам.
● Стены позволяют персонажам ходить по ним. Находясь на стене, персонаж оказывается на высоте– 2.
● Начальные стены не имеют НР и всегда являются «целыми».
● Покупные стены имеют 750 НР и могут быть разрушены.
● При уменьшении НР покупной стены до 375 и меньше,стена становится 
«полуразрушенной» и перестаёт быть пригодной для перемещения по ней.
 
<subtitle>Кусты.</subtitle>
Кусты–нейтральныепостройки,разбросанныепокартенережечемстены.Что
важнознатьокустах:
● Перемещение через кусты тратит 2 ловкости вместо 1 за 1 клетку зоны кустов
(вход в кусты тратит 1 ловкость, выход из них на обычную клетку- 2).
● Кустам невозможно нанести урон, или разрушить их.
● Находясь в кустах, Дальность атак и действий персонажа уменьшается вдвое (округление в большую сторону).
● Персонаж, который атакует другого персонажа, находящегося в кустах,
имеет 33% шанс обычного промаха (читать раздел «Бой»).
● Если атаковать персонажа находящегося по другую сторону от блока кустов,
промах от зоны кустов отсутствует.
● Персонажи с эффектом «Полет», находящиеся над клеткой кустов, не являются
укрытыми в них. Для них не работают все преимущества и недостатки этой зоны.
В том числе, дальность, ловкость и промах.
 
<subtitle>Крипы.</subtitle>
Логова крипов расположены на 4 клетках по углам карты. Данные точки не
являются постройками, а только показывают, где крипы будут возрождаться.
Что важно знать о крипах:
● Крипы являются уникальным типом существа. Они имеют все характеристики
персонажа, кроме маны.
● Крипы возрождаются (если они не были добиты, то умирают и рождаются снова)
на изначальном месте каждые 5 ходов, начиная с 5-го хода.
● Убийство крипа приносит 100 золота на счёт команды, нанесший последний удар
по крипу (подробнее про логику крипов читать в разделе «Бой» и «Судейство»).
Персонажи
В Сайкйонг Родус вы можете сыграть за более чем 50 уникальных персонажей с
интересными механиками. Каждый персонаж в той или иной мере имеет свои
слабые и сильные стороны (читать раздел «Стратегия»). Персонаж представляет из
себя “карточку персонажа” и “фигурку персонажа”. Фигурки в начале каждой
партии выставляются в красном квадрате.  
Персонажи делятся на 8 типов: Рыцарь, Маг, Стрелок, Танк, Некромант, Меха,
Наёмник, Иной. Подробнее про их роли в игре, мы поговорим в разделе
«Стратегия». Важно знать, что по умолчанию, маги имеют магический урон, стрелки
и мехи - технический, все остальные физический, если нет описанного уточнения.  
<title>Карточка персонажа.</title>
Карточка персонажа связана с фигуркой персонажа на поле. Карточка условно
делится на несколько частей:
<subtitle>1. Способности</subtitle>
Каждый персонаж владеет 3 уникальными способностями (2, если персонаж
- Танк). Способности делятся на разные методы выполнения а также типы. Таким
образом, первая строка каждой способности - Цена. Цена определяет какое
количество ходов необходимо подождать перед тем как способность снова можно
будет использовать. Также важно понимать:  
	 ● Все способности заряжены с начала партии. Однако есть исключения -
Третья способность Дейви Джонса, способности Сиехилда.
	 ● При использовании одной способности все способности уходят в
перезагрузку.
	 ● При использовании способностей с методом “Эффект” имеющие
длительность, цена на такую способность перезагружается сразу после
использования, а не после окончания эффекта, как можно подумать.
	 ● Некие способности не могут быть использованы, когда неактивен эффект
другой способности.
1.1. Строка урона
	 Строка урона описывает урон, наносимый той или иной способностью. Все
способности по умолчанию наносят урон соответствующий типу персонажа. Так,
способность рыцаря по умолчанию наносит физический урон, а стрелка -
технический. Если это не так, рядом со строкой есть уточняющий текст например
“(маг.) - магический, (тех.) - технический, (физ.) - физический”. Что важно знать о
строке урон под каждой способностью:
	 ● Если на месте урона стоит прочерк, значит способность не наносит урон.
	 ● Если в строке находится несколько чисел это может означать несколько
вещей, однако обычно это описывает последовательность урона наносимого этой
атакой:
○ Если числа записаны следующим образом “х * у”, это означает что
урон “х” будет наноситься на протяжении количества ходов “у”. Однако это
также может значить, что способность использует количество зарядов “у”,
каждый из которых наносит урон “х”. Однако, таких способностей не так
много, так что лучше запомните первый способ. В любом случае вы можете
подробнее узнать о способности из её описания.
○ Иногда помимо “х * у”, могут быть ещё числа. Например 
“х, у * z”. Это означает, что способность, помимо эффекта, также имеет и
мгновенный урон “х”. Таким образом, сначала наносится урон “х”, а после,
урон “у” на протяжении следующих “z” ходов.
○ Также при методе “возведение постройки”, строка урон описывает
урон постройки, а не урон от ее использования. Урон от постройки по
умолчанию совпадает с базовым типом урона персонажа, если нет
уточняющего текста.
○ Иногда уточняющим текстом может быть “(сквозь броню)”. Тогда
урон проходит сквозь характеристику “Броня”.
○ Король некромантов обладает второй способностью, синтаксис
которой следующий “+1 = +75(маг.)”. В данном случае, это нужно понимать
так: За каждого персонажа в области действия способности, каждому из
противников наносится урон равный 75 * количество персонажей. 
○ В целом, когда в строке идёт запись “+х” / “-х” это означает, что
способность усиливает или ослабляет какую-то свою или чужую
характеристику.
1.2. Строка типа
	 Строка “Тип” определяет способ применения способности. Есть три
основных типа способностей по их применению: Точка, Область и Луч.
● Точка.
	 Тип точка означает, что способность применяется по прямой линии от
персонажа на дальность указанную в строке “Размер” ниже. Такой урон не может
пройти сквозь постройки, персонажей и прочие объекты с высотой 1.
Также у точки есть несколько методов, о которых не написано на карточке, однако,
о которых следует помнить для полного понимания работы способности:
1. Атака - основной метод. Это обычная атака, которая наносит урон по
определенной клетке. Важно помнить, что такой метод наносит урон в кубе с
высотой 1, на высоте персонажа (Подробнее читать в разделе “Бой”).
2. Самоулучшение. Такие способности восстанавливают или увеличивают значение
одной характеристики персонажа.
3. Режим. Способности с методом “Режим” меняют от двух характеристик
персонажа: могут увеличивать ловкость, дальность и т.д. Они могут влиять на
второстепенные характеристики, такие как базовый уворот (Подробнее читать
раздел “Бой”). Также, такие способности могут кардинально менять
взаимодействие с персонажем, меняя или запрещая ему пользоваться одной или
несколькими способностями. Одним из примеров может быть первая способность
Амудсиаса.
4. Наложение эффекта. Такие способности позволяют накладывать на себя
определенный эффект. Например, полет, щит, невидимость.
5. Возведение постройки. Позволяет размещать объект на игровое поле на свою
дальность.
6. Призыв существа. Призывает Существо, которым далее можно будет управлять.
Подробнее читать раздел “Строительство”.
7. Телепортация. Мгновенно перемещает персонажа в любую точку в пределах
определенной области, радиус которой указан в радиус. Если конечной точкой
поставить постройку, персонаж будет вытолкнут на выбранную игроком соседнюю
свободную клетку.
8. Перемещение в точку. Перемещает персонажа на расстояние указанное в
размере, однако в отличии от телепортации, перемещение в точку не проходит
сквозь стены, персонаж просто двигается как если бы он просто перемещался.
● Область  
	 Тип область, означает что действие, будь-то эффект или простой урон,
применяется равно по определенному “Размером” радиусу.  
Форма области по умолчанию - ромб, самые вытянутые стороны которого - и есть
радиус области. Иногда, форма может отличаться. Например: если в размере
написано “х * х” обычно это означает что форма - квадрат, где персонаж находится
в центре. Также могут встречаться уникальные формы области, такие как “крест” -
распространяется на 4 стороны и только на эти 4 стороны, на свой размер.  
Следует также помнить, что эффект области может проходить сквозь стену и
персонажей, имеет высоту 1, за исключением редких описанных исключениях, где
эффект может также уходить в высоту.
● Луч  
	 Тип луч, означает что действие будет выполняться по всей длине прямой
линии в выбранном направлении на свой размер. Если размер не указан, он равен
дальности по умолчанию и меняется вместе с ней (например если она была
увеличена предметом или высокой позицией). Луч может проходить сквозь
персонажей, однако останавливается при встрече с постройкой.  
У луча есть один уникальный метод:
1. Луч с перемещением. Не путать с телепортацией, так как она позволяет
мгновенно переместиться в определенной области. Луч с перемещением, двигает
персонажа по прямой, позволяя ему проходить сквозь персонажей (или двигать их
в редких исключениях), но не постройки.
Также, важно помнить, что при использовании луча с перемещением над уровнем
поверхности, когда персонаж покидает постройку своим рывком он падает на
землю и мгновенно получает урон от падения (Читать “Бой”).
1.3. Строка размера
	 Строка размера определяет зону, на которой будет использоваться
способность. Часто, в строке размер можно встретить просто черту.
Обычно это значит, что способность применяется на персонажа, её
использовавшего. Однако это также может значить что способность никак не
взаимодействует с игровой картой. Яркий тому пример - Крестоносец и его первая
способность, которая лечит всех персонажей вне зависимости от того, где они
находятся. Именно поэтому строка размера - отсутствует.
В строке размер, чаще всего прописывается дальность/радиус способности
выраженный в количестве клеток. Однако, если у способности есть длительность,
она также указывается в строке “Размер” выражаясь в количестве ходов. Таким
образом, содержание строки “Размер” может быть следующим: “5 клеток”, “5
клеток/3 хода” “10 ходов”.
<subtitle>2. Центральная часть карточки</subtitle>
	 Эта часть несет в себе такую информацию о персонаже как: Внешность, Имя
и, конечно, Тип персонажа.
На данный момент в Сайкйонг Родус есть 8 типов персонажей:
1. Рыцарь.
	 Рыцарь имеет средние характеристики и довольно высокие показатели
урона что делает их непревзойденными атакующими персонажами. Их урон -
физический. Большинство их способностей это простые атакующие способности,
наносящий мгновенный урон, что позволяет легко проводить быстрые атаки или
затяжные бои.
2. Маг.
	 Маг имеет относительно маленькие характеристики урона и живучести.
Однако он отлично подходит для первых боев в партии, так как маг имеет
магический урон, который сносит 2 брони с одной атаки. Почти все способности
магов наносят магический урон, однако довольно часто это сложные способности,
с большим описанием, а не простое колдовство. Также, маги имеют самые высокие
показатели маны, что позволяет им закупать предметы для улучшения себя или
постройки для укрепления позиций на карте.
3. Стрелок.
	 Стрелок отстает от всех типов критически низкими показателями урона и
здоровья. Однако секрет стрелка в том, что он может наносить технический урон
на большом расстоянии, избегая сражений вблизи, и, благодаря хитрости и
ловкости, добивать противников.
4. Танк.
	 Танк славится своей живучестью и уроном. В то время как ловкость и мана -
их слабое место. Они неповоротливы и не могут угнаться за обычными
персонажами. Однако, если попасться танку под удар, можно прощаться с жизнью.
Урон танков исключительно физический. Они полагаются на грубую силу своего
тела. Видимо поэтому, вместо трех способностей, танки пользуются всего двумя.
5. Некромант.
	 Некроманты используют темную магию в своих целях и уничтожают ею
противников. Их способности часто накладывают негативные эффекты на
противников либо положительные эффекты на себя или союзников. В целом,
можно сказать, что некроманты - персонажи поддержки, но в многих случаях, они
могут выступить как атакующие персонажи или поддержка уроном. Их урон по
умолчанию - физический, однако часто некроманты могут использовать
магический урон конкретными способностями или обычными атаками, как
например Жнец.
6. Меха.
	 Меха - тип объединяющий роботов, у которых отсутствует показатель маны.
Это запрещает им покупать предметы в магазине и как либо накапливать
накапливать ману. В противовес этому у мех относительно высокие показатели
урона и здоровья. Мехи атакуют техническим уроном, часто на среднюю дальность
вместо ближней.
7. Наемник.
	 Наемники профессиональные воины, которые мастерски владеют своим
оружием. Они, как и танки, полагаются на грубую силу, поэтому показатель маны у
них понижен. Вместо этого они имеют уникальную механику призыва предмета. На
6 ход (и через 6 ходов после потери) действием можно призвать себе свой
уникальный предмет. У каждого Наемника он свой и позволяет усилить конкретный
аспект персонажа, будь-то повышение процента критического урона или просто
ускорение. Урон наемников - физический.
8. Иной.
	 Иные вбирают в себя всех персонажей, которые не попали в остальные типы.
Единственное что их объединяет - Иные полагаются на свои способности. А
способности у них могут быть совершенно невероятные.Отличный пример это
Заклинатель рун и Кобольд. Урон у Иных - физический, однако есть множество
исключений.
Также, под именем и типом персонажа может быть поле с информацией об
особенностях персонажа, однако чаще всего это поле отсутствует.
<subtitle>3. Инвентарь персонажа.</subtitle>
	 Три пустые клетки на карточке персонажа отображают пустой инвентарь из
трех слотов для предметов. При покупке или подборе предмета, он будет
отправляться именно туда. Также при призыве уникального предмета Наемником,
предмет отправляется туда. Важное примечание: при покупке стен, они
отправляются в один слот вместо трех.
3.1 Типы предметов
В Сайкйонг Родус, у каждого предмета, который можно положить себе в инвентарь
есть свой тип и способ применения. Таким образом, в игре есть:
● Постройки. Такие предметы как Башни Лучников, Турель, стены и прочие
предметы которые могут быть выставлены на игровое поле в соответствии с
правилами (читать «Строительство»).
● Снаряжение. Это большинство предметов магического магазина, все что
может надеваться и давать какие-то бонусы, усиливать или накладывать
эффекты при этом не исчезая из инвентаря является снаряжением.
● Расходники. Это предметы, которые после использования исчезают из
инвентаря. Такими расходниками являются Элитры, Зелье здоровья (любые
другие зелья), Свиток чар, Свиток телепортации и т.д.
4.Основные характеристики.
У каждого персонажа есть 6 основных характеристик:
● НР (Очки здоровья)
● Урон
● Мана - в игре является валютой, с помощью которой, персонажи  
могут приобретать предметы в “Лаборатории” и “Оружейной”.
● Ловкость
● Броня - В Сайкйонг Родус при атаке персонажа, урон сначала  
будет приходиться по броне.
● Дальность - Показывает на сколько клеток персонаж может  
атаковать. Чаще всего персонаж может атаковать на дальность 1. Подробнее
мы поговорим о них в следующем разделе.
<title>Бой</title>
В процессе партии, Ваши персонажи будут сражаться с противниками и потому,
важно понимать, как работает боевая система в Сайкйонг Родус.
<subtitle>Основы</subtitle>
Для начала, важно понимать, что персонаж может атаковать простой атакой с
руки, нанося урон равный урону, указанному в характеристиках, либо же
способностью. В первом случае, урон проходит по прямой линии до первой цели
начиная от персонажа. Таким образом, если на пути стрелы Лесного брата стоит 2
персонажа, она остановится на том, который стоит ближе к Лесному брату.
Атаки персонажа не могут проходить сквозь стену и любые другие постройки,
высота которых равна или превышает высоту атаки персонажа.
Также, самое необходимое Вы можете найти в разделе “Первые шаги”. Теперь про
вычисления при сражении.
● Когда персонаж атакует простой атакой, он наносит количество урона равное
сумме пассивного урона (урона, прописанного в карточке персонажа) и
предметов, дающих бонус к атаке.
● Получая урон, НР персонажа уменьшается на количество равное исходящему от
атакующего персонажа урону.
● Если у персонажа, которого атаковали, есть броня, удар придет по ней. Важно
помнить, что атака физическим и техническим уроном, сносят одну броню за
атаку (неважно сколько урона она наносит), в то время как магический урон
сносит 2 брони за атаку.  
Примечание: Если персонажа с одной броней атаковали магическим уроном, его
броня снесется, а НР уменьшится на половину от суммарного урона за ход
(округление к большему).
● За убийство персонажа противника, союзная команда получает 500 золота на
общий баланс.
● Общий баланс золота команды значит, что любой персонаж может союзной
команды может купить что-то в магическом магазине воспользовавшись этим
балансом.
● За убийство крипа, команда, нанесшая последний удар по крипу получает 100
золота на общий баланс.
● За убийство вражеского призванного существа, союзная команда получает 25
золота на общий баланс.
● Персонажи могут бить союзных им персонажей, союзных существ и союзные
постройки (в том числе и базу).
● За убийство союзных персонажей, союзных существ и союзных построек,
союзная команда не получит золота, так же как и команда противника. Золото
просто исчезнет.
● После смерти персонажа, все предметы из его инвентаря пропадают.
● После смерти все союзные постройки возведенные способностью убитого
персонажа пропадают с карты. Это, однако, не распространяется на нейтральные
постройки, такие как, например, вторая способность Дубового Энта, или первая
способность Древнего.
<subtitle>Правила подсчета характеристик</subtitle>
При покупке предметов из магического магазина, особенно предметов на усиление
базовых характеристик, вычисление атаки может стать настоящим испытанием.
Вот несколько указаний о том, как необходимо вычислять урон:
Урон от атаки = (пассивный урон персонажа (тот который написан на карточке) +
бонусный урон, от предметов или состояния) х количество атак (если есть предмет
увеличивающий количество атак. Это не то же самое что двойной урон) (минимум 1)
При этом, все бонусы зелий, предметов и состояний используют в качестве
ориентира именно пассивный урон персонажа.
Например: Палладин имеет 150 урона по умолчанию. Если поставить на него Катану
и Скипетр Кроноса, то у Паладина будет 200 урона (150 пассивного и 50 от катаны),
а также 25% шанс нанесения двойного урона. Однако под двойным уроном
означает именно 150 урона сверху, а не 200.
Это правило применимо и к другим сферам, не только к урону. Таким образом,
если у Палладина есть Алый бокал, который он использует при атаке с Катаной, то
он вернет себе 75 урона (Алый бокал восстанавливает половину от урона Паладину
в НР), а не 100, потому что при подсчете вампиризма учитывается именно
пассивный урон.
<subtitle>Виды урона</subtitle>
В Сайкйонг Родус есть несколько видов урона. Каждый из них имеет свои
особенности.
Основных видов урона 4:
1. Физический урон. Такой урон наносят атаки оружием ближнего боя, а также
большинство способностей всех типов персонажей. Например вторая
способность Минотавра, либо зелье яда. Иными словами, если тип персонажа
Рыцарь, Танк, Некромант, Наемник или Иной, то любая его атака без
уточненного типа урона будет наносить физический урон. Также, все атаки от
зелий, построек, либо призываемых существ по умолчанию имеют физический
тип урона. Атака физическим уроном по персонажу с броней, будет разрушать
одну броню.
2. Технический урон. Такой урон наносят атаки выстрелами, будь-то лук, мушкет
или удары мех. Например, обычная атака Сталевара, либо же первая
способность Снайпера. Иными словами, если тип персонажа Стрелок или
Меха, то любая его атака без уточненного типа урона будет наносить
технический урон. Атака техническим уроном по персонажу с броней, будет
разрушать одну броню.
3. Магический урон. Такой урон наносят атаки магией либо молниями. Например
зелье магического удара молнией, очевидно, наносит магический урон, как и
третья способность Дракулы. Иными словами, если тип персонажа Маг, то
любая его атака без уточненного типа урона будет наносить магический урон.
Атака магическим уроном по персонажу с броней, будет разрушать сразу две
брони. В случае, когда у персонажа остается одна броня и его атакуют
магической атакой, урон от этой атаки снимет оставшуюся броню, а также
нанесет 50% от своего урона по НР такого персонажа.
4. Чистый урон (сквозь броню). Такой урон наносят атаки проходящие сквозь
броню. Например, урон от падения с высоты, либо же атаки в скобочках рядом
с которыми написано «(сквозь броню)». Нет персонажей, которые по умолчанию
наносили бы чистый урон.
<subtitle>Складывание урона за ход</subtitle>
Для того чтобы всегда складывать урон за ход правильно нужно помнить
несколько правил последовательность накладывания удара. Так:
1. Эффект от союзной постройки по противнику. Например, башня лучников бьет
150 техническим уроном по противнику.
2. Эффект от союзного объекта на карте. Например, зелье отравления наносит
100 физического урона, или зелье заморозки наносит 50 чистого урона.
3. Пассивный урон от предмета на персонаже. Например корона Ра наносит 50
физического урона в радиусе 3 от носителя.
4. Активный урон по персонажу. Например, атака и способность. В случае
обычной атаки, к урону может прибавляться бонусы от персонажей (например
первая способность огненного Шамана, или пассивный бонус к урону от
Катаны).
Что важно помнить о складывании:
● Суммарное количество брони снятое за ход - это максимальное количество
брони которое может снять атака. Например, если в сумме было нанесено 300
физического урона, при этом у персонажа одна броня, то за ход персонажу будет
снята только одна броня. Даже если было нанесено три атаки по персонажу, в
сумме, за один ход, будет разрушена только одна броня. Таким же образом, если
было нанесено две атаки физическим и техническим уроном и одна атака
магическим уроном, в сумме за ход, будет снято две брони (поскольку
магический урон снимает две брони).
● Если в сумме было нанесено 100 физического урона и 50 магического урона, при
этом у персонажа осталась только одна броня, урон рассчитывается как 150
урона, снимающего две брони. То есть, у персонажа снимет одну броню, а также
нанесет 75.
<subtitle>Складывание уклонения и промаха за ход</subtitle>
В Сайкйонг Родус есть множество предметов, способностей, а также зон, которые
позволяют персонажу избежать урона. Например, Эльфийский плащ, Кольцо
ветров или зона кустов. Сама механика уклонения и промаха достаточно проста.
Сложности возникают когда проценты приходится складывать. Ниже будет
описано то, как правильно это делать.
Начнем с того, что промах и уклонения это вещи, хоть и схожие по идее, все же
разные по принципу действия. Когда персонаж с шансом промаха атакует другого,
именно тот персонаж который атакует будет кидать кость, для проверки
попадания. Например, находясь под действием Дымовой шашки, именно персонаж
который атакует, будет бросать промах на свою атаку. Если же есть несколько
источников промаха (обычного для обычных атак, и универсального для обычных
атак и способностей), персонаж атакует с наименьшим процентом среди них.
Уклонение, в свою очередь, это именно особенность получающего урон. Когда
персонаж атакует другого персонажа, у которого есть какой-то процент уклонения,
бросать кость будет именно этот, другой персонаж, которого атакуют. Касательно
складывания процентов при уклонении, следует помнить, что для универсального и
обычного уклонения ведется два разных подсчета процентов. Например, если у
персонажа есть Эльфийский плащ, дающий 25% обычного уклонения, а также
Кольцо ветров, дающее 10% универсального уклонения, эти проценты не будут
складываться и если персонажа атакуют обычной атакой, персонажу нужно будет
бросить кость универсального уклонения, а затем кость обычного уклонения
отдельно. В остальном же, проценты одинакового типа уклонения, будь-то обычное
или универсальное, складываются. Например, 5 Колец ветров дают суммарный
процент универсального уклонения равный 50%.
Подводя итог всему выше сказанному, вот последовательность бросков костей при
обычной атаке:
1. Универсальный промах (бросает атакующий)
2. Обычный промах (бросает атакующий)
3. Универсальное уклонение (бросает атакованный)
4. Обычное уклонение (бросает атакованный)
Если же применяется способность, последовательность будет такая:
1. Универсальный промах (бросает атакующий)
2. Универсальное уклонение (бросает атакованный)
<subtitle>Взаимодействия с предметами</subtitle>
Почти в каждой партии, один или несколько персонажей кладут предметы себе в
инвентарь. Это важная часть игрового процесса, поэтому важно знать как работать
с предметами:
● Выкладывание предмета. Выкладывание предмета - это действие, которое
позволяет разместить предмет на соседней от персонажа свободной клетке.
Порталы и третья способность Кобольда, хоть и являются по факту свободной
для прохода клеткой, все же являются постройкой и на них не может быть
выложен предмет. Также, предмет не может быть выложен на клетки с уже
размещенным на нем предметом. Через клетки с выложенным предметом можно
проходить. Предметы можно выкладывать между уровнями высоты. При чем,
выкладывая предметы вниз, ограничения на разницу в высоте - нет. Таким
образом, например, Плут, стоящий на стене (высота: 2), может выложить предмет
на землю возле стены (высота: 0), точно так же как если бы Плут сам стоял на
земле. С выкладыванием предметов на высоту больше своей, есть ограничения.
Максимальная разница высоты на которую можно выложить предмет - это +1.
Таким образом, подойдя вплотную к стене, персонаж может выложить на нее
предмет. Примечание: кусты, как и зона лечения вокруг базы, не являются
постройками, а зона с эффектом.
● Подбор предмета. Подбор предмета - это действие, при котором персонаж
перемещает предмет, лежащий на соседней от персонажа клетке, себе в
инвентарь. Подбор предмета может совершаться на высоте +1, 0, -1
относительно персонажа. Таким образом, персонаж, подошедший к стене, на
которой лежит предмет (высота такого предмета - 1), при этом находясь на земле
(высота такого персонажа - 1), может, без проблем, подобрать предмет.
● Передача предмета. Передача предмета - это действие, которое можно
выполнить если, союзный персонаж, или союзное призванное существо с
инвентарем, находится на соседней клетке от носителя предмета. Оно переносит
предмет из одного инвентаря в другой. Если разница высоты между персонажами
не больше одного блока высоты (например, один расположен на земле (высота -
1), а другой стоит на стене (высота: 2)), передача так же возможна. В ином случае,
передать предмет не получится. Примечание: Третья способность Плута является
передачей, так что тоже может работать между одним блоком высоты.
● Бросок предмета. Бросок предмета - это действие, активирующее предмет, для
активации, которого он должен быть брошен. К таким предметам, относятся:
Зелье отравления, Зелье заморозки, Дымовая шашка, Зелье магического удара
молнии, Свиток пиромантии и т.д. Бросок любого предмета совершается на
расстояние 1-5 от персонажа. Например, персонаж может разбить зону зелья
отравления прямо под собой, либо же кинуть его на расстояние до 5 клеток.
Такой бросок имеет тип атаки: точка, даже если после разбития создает область
под собой. Область предмета разбитого на земле проходит сквозь стены, если в
карточке предмета не описано обратное.
Когда в инвентаре персонажа есть несколько предметов, эти предметы можно
перемещать как угодно, вынимая и убирая их в рюкзак, или просто менять местами
в инвентаре. Это не является действием.
<subtitle>Высота</subtitle>
В 4-й редакции Сайкйонг Родус введено понятие высоты.
Когда говорится высота 1, подразумевается, что персонаж стоит на земле. Если мы
говорим высота -1, это значит что персонаж расположен под землей. Например,
Кобольд может находиться на уровне -1, копая свои шахты. По такому же
принципу, если высота 2, то персонаж находится над землей. Например, персонажи
расположенные на стене, либо в полете, находятся на высоте 2.
Также, если, к примеру, встать Дубовым Энтом на стену и запустить в свои кроны
стрелка, высота стрелка будет 3 блока.
Большинство построек имеют высоту 1 блок, поэтому сквозь них нельзя пройти и
поэтому через них нельзя атаковать. Исключением являются порталы, высота
которых 0. Они расположены в земле, поэтому через них можно пройти и
атаковать. Касательно порталов есть ещё одна особенность. Портал открыт на
бесконечное количество высоты вверх, однако не под землю. Таким образом, если
в портал попадет летающий персонаж на высоте 2, он сможет переместиться через
него и оказаться на другом конце на той же высоте. В то же время, Кобольд,
находящийся под землей (на высоте -1) не может воспользоваться порталом.
У всех персонажей, высота - 1 блок, неважно Пикси это, или Гигант. У всех
призванных существ высота так же 1 блок.
У предметов, выкладываемых на поле, чтобы передать кому-то, или, например,
зелий, которые активируются выкидыванием, высота - 0, так как они лежат на
земле и их можно перейти.
Особенности атаки между разными уровнями высоты.
Персонажи обычно не могут атаковать персонажей, находящихся на другом
уровне. Однако с техническим уроном, все по другому. Тут разница в высоте может
сыграть на руку.
Так, стрелки или мехи (дальность которых 4+) могут атаковать на свой уровень как
и все остальные типы, а также могут атаковать на уровень +1 и -1 от своего.
Однако, дальность при таких атаках будет другой. При выстреле на уровень -1,
например со стены по объекту на земле, такие персонажи с техническим уроном
получат +2 к дальности выстрела. А при выстреле на высоту +1 они получат -2 к
дальности выстрела.
Касательно способностей стрелков и мех. Если у способности, метод Атака и тип
Точка или Луч, то она может быть нанесена по такому же принципу. Однако
способности с типом область не работают на другие уровни, а только на том на
котором их применили, за редким исключением в виде второй способности
Воздушного Монаха, которая также может сбить персонажа находящегося рядом в
полете.
<subtitle>Спуск с высоты</subtitle>
При переходе с одной высоты на другую, будь то лестницы Кобольда, либо же
использование Элитр, важно помнить что, при подъеме, персонажу необходимо
выполнить действие. Например действие «Залезть по лестнице Кобольда». Тем не
менее, спуск с высоты, например окончание действия Элитр или спуск в тоннели,
будет являться перемещением. Такое перемещение называется «контролируемое
падение». Это значит, что персонаж не получает урона.
<subtitle>Эффекты</subtitle>
В Сайкйонг Родус есть множество уникальных эффектов, которые работают
достаточно сложно. В данном разделе, будет приведена их классификация.
Для начала, важно помнить, что эффекты делятся на три типа:
1. Положительные эффекты - это эффекты, которые усиливают персонажа. Это
могут быть эффекты усиления урона, либо щит.
2. Негативные эффекты - это, как правило, эффекты накладываемые на
противников, понижающие их характеристики. Например, эффект от Зелья
заморозки, либо первая способность Йети.
3. Нейтральные эффекты - это эффекты, которые не приносят явного усиления
персонажу, но скорее просто меняют игровой процесс за него. Явным
примером такого нейтрального эффекта является Полет.
У каждого типа эффекта есть множество представителей.
1. Положительные эффекты
● Лечение - это эффект, который восстанавливает персонажу некоторое
количество НР на протяжении некоторого количества ходов.
● Щит - это эффект, дающий дополнительное количество НР или Брони на
некоторое количество ходов, после которых, остаток от щита исчезает. Так,
первая способность Голиафа, дает 300 НР бонусом на 10 ходов. Однако,
если за эти 10 ходов щит будет снесен, то эффект закончится раньше. Если
же, например, щит будет снесен на 90%, оставшиеся 10% просто исчезнут
по истечению 10 ходов. Все атаки, пока щит активен, приходятся по нему, а
не по персонажу.
● Ускорение - это эффект, увеличивающий характеристику Ловкость на
некоторое количество ходов.
● Усиление урона - это эффект, увеличивающий характеристику Урон на
некоторое количество ходов.
● Очищение - это мгновенный эффект, позволяющий снять с персонажа все
негативные эффекты на нем. Эффектом очищения обладает Зелье лечения,
а также третья способность Древнего.
● Иммунитет к урону - это эффект, понижающий получаемый урон на
некоторое количество ходов. Это может быть определенный тип урона, или
любой урон. Также, это может быть 100% иммунитет, либо же частичный.
● Точность - это эффект, позволяющий атаковать, не учитывая промах и/или
уклонение.
● Вампиризм - это эффект, позволяющий восстанавливать НР от атаки по
противнику. При этом, вампиризм работает только если у противника
снимается НР.
2. Негативные эффекты
● Ядовитый урон - это эффект, наносящий урон на протяжении нескольких
ходов, вне зависимости от того, что делает персонаж. Пример такого
ядовитого урона является эффект Зелья отравления, вторая способность
Юань-Ти, а также третья способность Лесного брата.
● Слабость - это эффект, запрещающий персонажу использовать
способности на некоторое количество ходов. Не распространяется на
предметы.
● Уязвимость - это эффект, под действием которого, урон по персонажу
будет увеличено на определенное число, либо в процентах.
● Опутывание - это эффект, под действием которого, персонаж не может
двигаться, однако может действовать, использовать способности и
предметы.
● Оглушение - это эффект, под действием которого, персонаж не может
двигаться и как-либо действовать на некоторое количество ходов.
● Обезоруживание - это эффект, под действием которого, персонаж не
может использовать активные способности предметов.
3. Нейтральные эффекты
● Невидимость - это эффект, при котором, персонаж становится неуязвимым
на некоторое количество ходов, а по истечению длительности эффект,
персонаж может переместиться на ловкость * длительность эффекта. При
этом такой персонаж не может никого атаковать в эти ходы.
● Полет - это эффект, при котором персонаж поднимается на высоту +1 от
своей и становится недосягаемым для атак персонажей внизу. Подробнее
читать выше.
● Страх - это эффект, под действием которого, персонаж убегает от
источника страха на свою ловкость в течении нескольких ходов, таким
образом, чтобы оказаться от него как можно дальше. В официальных
партиях (читать «Судейство») путь, которым персонаж убегает от источника
страха, должен быть проложен независимым судьей. В играх без судьи,
игрок напуганного персонажа выбирает этот путь.
● Притягивание - это эффект, под действием которого, персонаж обязан
приближаться к источнику притягивания на свою ловкость в течении
некоторого количества ходов. В официальных партиях (читать «Судейство»)
путь, по которому персонаж идет к источнику страха, должен быть проложен
независимым судьей. В играх без судьи, игрок притягиваемого персонажа
выбирает этот путь. Также, притягивание не сбивает эффект полета, даже
если источник находится ниже персонажа

● Провокация - это эффект, под действием которого, персонаж обязан
потратить действие, чтобы атаковать обычной атакой или способностью
источник провокации.
<title>Строительство</title>
Строительство в Сайкйонг Родус - это неотъемлемая часть игрового процесса, так
же, как и бой.
Вот несколько общих правил постройки в игре:
●Возведение постройки - это действие.
●После покупки постройки, она отправляется в инвентарь.
●Постройка, купленная в Оружейной, строится на любой точке союзной половины
карты, на, по умолчанию, свободных клетках (исключениями являются Башни
лучников, которые строятся на стенах). Это значит, что даже находясь возле
магазина, можно расположить например Турель в любой точке союзной половины
карты

●На вражеской территории, купленные постройки могут быть возведены только на
соседней от персонажа клетке:
●Правило не распространяется на постройки, возводимые способностью.
Например, третья способность Огненного шамана. Ее можно размещать на свою
дальность, где угодно, кроме синего квадрата.
●За один ход можно возвести сколько угодно стен, находящихся в инвентаре.
●Постройки, такие, как Башня лучников и Турель не могут быть возведены на
вражеской территории, однако их зоны могут на нее заходить.
●Зоны возведенных построек не могут заходить на территорию красного
квадрата.
●Постройки можно возводить на зоне кустов, как и на любой другой зоне, любой
постройки.
●Постройка не может быть возведена внутри синего квадрата (неважно какой
команды).
●Постройки или предметы с типом применения область не имеют никакого
эффекта на нейтральные постройки.
●Способности с типом применения область так же не имеют никакого эффекта на
нейтральные постройки.
●Постройки не атакуют другие постройки, только если об этом не указано в
описании постройки.
● Зона постройки не может перекрывать 4 и более клеток магазина и заходить на
зону восстановления маны.
● Запрещается возводить стены вплотную к магазинам

Важно различать постройки и призываемых существ. Призываемые существа - это
постройки, которыми можно управлять после возведения. К таким существам
относится например Повозка. Что важно знать о призываемых существах:
●Призываемые существа наследуют логику возведения обычных построек.
●Управление призываемым существом является действием. Таким образом, можно
например подвигать персонажем, а после этого воспользовавшись действием
«Управление призываемым существом» переместить призываемое существо.
●Призываемые существа могут обладать всеми характеристиками персонажа,
способностями, инвентарем и т.д.
●Призываемые существа не могут покупать предметы в магазинах.
●Различают два типа призываемых существ: нейтральные и союзные (и вражеские
соответственно).
●Постройки не атакуют нейтральных призываемых существ (Повозка является
нейтральным призываемым существом, ей могут воспользоваться обе команды).
●При убийстве союзного призываемого существа, вражеская команда, убившая
существо, получает 100 золота.
●При убийстве персонажа, который призвал союзное существо способностью,
последнее умирает (100 золота зачислится за такое существо).
Стратегия
Как говорилось ранее, Сайкйонг Родус - это стратегия. В игре есть тысячи разных
вариантов игры в зависимости от персонажей в команде и купленных предметов.
Даже выбор базы может критически повлиять на исход битвы. В этой главе будет
описана общая концепция игры, общие советы по ведению боя, а также несколько
идей для связок предметов и персонажей.
<title>Партия</title>
Ещё до того как партия началась, а персонажи были расставлены, необходимо,
хотя бы отдаленно, понимать как играть за данных персонажей и какую
долгосрочную стратегию выстроить. Например, за Пламенного Шамана подойти к
оружейной и уйти в защиту, копя ману и покупая шахты, чтобы к 30-м ходам
накопить золота на множество серьезных магических предметов, при этом не
рискуя персонажами. Либо же расставить быстрых персонажей близко к порталам
чтобы атаковать противников и сразу же оставлять себе пути отступления. Для
того, чтобы не терять несколько ходов на перемещение персонажей к
необходимым точкам, их важно сразу расставлять возле правильных выходов из
базы. Так:
● Более ловких персонажей можно выставлять у дальних выходов. Соответственно
медлительных персонажей лучше ставить к ближним, чтобы они быстрее дошли
до центра.
● Имеет смысл выставлять персонажа с наибольшим значением маны возле
выхода, который ближе к необходимому для закупки желаемыми предметами
магазину. Для поддержки, с той же стороны, можно выставить самого быстрого
персонажа, который сможет помочь уроном, если персонажа с маной окружат.
● Персонаж, на которого есть смысл закупить один или несколько магических
товаров, правильно ставить возле самого дальнего выхода из базы,
направленного к магическому магазину.
● Если в союзной команде есть Энт, то первые пять его лучше окружить со всех
сторон союзными персонажами, если у противника есть способности с
телепортацией.
● Медлительных персонажей есть смысл выставлять возле выхода, который ближе
к телепортам, так танки, добравшись до них, смогут контролировать больше
территории карты.
После того, как персонажи выставлены, игра начинается. Помните что после того
как первый игрок переместил персонажа, менять персонажей в зоне красного
квадрата уже нельзя.
Для правильного ведения боя в Сайкйонг Родус, необходимо знать базовые основы
стратегии именно для этой игры. Хороший стратег в Сайкйонг Родус, это тот,
который может подстроить ситуацию под себя с любым набором союзных и
вражеских персонажей. Тем не менее не стоит переоценивать своих персонажей и
недооценивать вражеских.
В Сайкйонг Родус есть 4 основных вида ведения боя: Защита, Атака, Экономика,
Наскок. Рано или поздно (обычно где-то к 15 ходу) все игроки определяются с
видом.
Автор делит игровую карту на 6 боевых зон: верхний левый телепорт, верхний
магазин, верхний правый телепорт, нижний левый телепорт, нижний магазин,
нижний правый телепорт. Имейте это ввиду. Автор будет использовать именно
такую терминологию при объяснении. Имейте ввиду, что также очень многое
зависит от вашей базы. Если Вы находитесь дальше от Лаборатории, но ближе к
Оружейной, стоит подстроить свою стратегию под игру с Оружейной и отказаться
от походов к Лаборатории в 1 и 3 этапах игры. Если же всё наоборот то зеркально.
Тем не менее, поход к Лаборатории является всё же более опасным чем к
Оружейной. Всё из-за типов покупаемого товара. Таким образом, расставляя
персонажа имейте ввиду, что если Вам позволяет расположение базы, как можно
быстрее захватите зону верхнего магазина. Если же ситуация не позволяет, то
лучше не лезть туда до второго этапа игры.
Примечание: Автор делит процесс игры на 4 стадии:
1. Подготовка к первой битве (Начало игры – Нанесение первого урона),
2. Первая битва (Нанесение первого урона – Первое убийство),
3. Закупка к главной битве (Первое убийство – Нанесение урона после закупки)
(на самом деле, на данном этапе уже видно, кто скорее всего победит в партии),
4. Главная битва (Нанесение урона после закупки – Конец игры).
<subtitle>Атака.</subtitle>
Игра за атаку в партии предполагает постоянное давление на вражескую команду.
Медленно, но уверено, союзники продвигаются по полю захватывая всё на своём
пути. Это отличная тактика против большинства типов воинов. Тем не менее,
против быстрых персонажей, способных купить Зелье отравления, эта тактика
хромает. Играя за атаку, как можно быстрее захватите зону с Лабораторией, даже
если пожертвуете своим построением. Идеальными для атакующей стратегии
являются: Минотавр, Саламандра, Юань-Ти, Берёзовый Энт, Легионер. После
того, как Вы захватили Лабораторию, уничтожьте персонажа вражеской команды,
пытавшегося сделать тоже самое. Уничтожив его, сразу купите ускоряющие и
перемещающие предметы для своего медленного атакующего персонажа, которого
Вы оставили на базе. Идеальным выбором будет: Сапоги света, Ртутные сапоги,
Свиток телепортации и Перчатка повышенного урона. Скорее всего, на данном
этапе, враг попробует или захватить Оружейную или отбить Лабораторию (врядли). В обоих случаях, Вам поможет этот самый персонаж. За количество ходов, за
которое можно выполнить закупку на персонаже, враг успеет доставить максимум
одного персонажа к магазину. С помощью Сапог света Вы сможете доставить
персонажа к тому или иному магазину. Если же Вы захватили Лабораторию играя
на базе которая дальше от Лаборатории и Вам не переместиться с помощью свитка
телепортации и Сапог света, хорошим решением будет купить Ртутные сапоги,
активная способность которых увеличивает вашу ловкость в 2 раза + 6. Уничтожьте
второго противника на противоположном магазине. На этом этапе, если Вы не
потеряли больше двух персонажей, можете считать себя победителями. Доставьте
остальных персонажей (кроме одного, стоящего на защите базы) к этим двум зонам
с магазинами. Теперь если к Вам отправятся персонажи противника, Вы будете в
преимуществе, за счёт быстрого перемещения между порталами (Напоминаю
перемещение между порталами не требует ловкости). Всё что Вам остаётся
сделать – грамотно распорядится воинами и окружить базу противника.
<subtitle>Защита.</subtitle>
Игра в защите, как правило, строится на распределении своих персонажей по
своей территории и мобилизация войск таким образом, что они могут прибежать в
любую точку на половине своей карты за 1-2 хода. Для такого вида идеально
подходит игра на стороне Оружейной. Если у Вас в команде: Леприкон, Сиехилд,
Палладин и большинство некромантов, игра за защиту будет для Вас идеальной.
Для начала, позаботьтесь о доступе к Оружейной для покупки стен и башен
лучников. Играя в защиту, у Вас есть много времени для подготовки кпервому
сражению. За это время, купите одну или две башни лучников, поставьте их таким
образом, чтобы путь от Лаборатории к Вашей базе был перекрыт зонами башен.
Это вынудит врага пойти через Оружейную и обесценит его позицию у
Лаборатории. Персонажа, купившего Башни сразу поставьте на храм, чтобы копить
ману. После покупки, выставьте одного из персонажей между Оружейной и вашей
базой, второго поставьте на портал для окончательного перекрытия пути от
Лаборатории до Вашей базы. Остальные два персонажа защищают базу.
Выдвиньте их немного за пределы красного квадрата. Одного к магическому
магазину, второго к порталу. Эти два персонажа не так приоритетны, как
остальные три, поэтому выводите их в конце. Если у Вас остаётся время, купите за
персонажа, стоявшего на храме, хотя бы одну тройку стен, для задержания
противника в экстренном случае. Всё готово. Теперь просто ожидайте, атаки со
стороны противника. Если противник ни в какую не хочет атаковать и у него нет
Плута в команде, купите несколько Зелий отравления и ждите. После, грамотно
распоряжайтесь своими войсками и Вы победите.
<subtitle>Экономика.</subtitle>
Игра за экономику в Сайкйонг Родус является сложнейшей. Несколько раз
подумайте, прежде чем выбирать именно такой стиль игры. Возможно, Вам лучше
выбрать игру в защите (читать выше). Важнейший аспект, при котором Вам будет
выгодно играть в экономику, это игра противника. Если он решил играть в защите,
то только тогда Вы можете пробовать играть в экономику. Для данного стиля игры
лучше всего подойдут: Варвар, Крестоносец, Кобольд,
Снайпер и т.д. Иными словами, персонажи, которые могут:
● Атаковать вражеских персонажей не покидая своей территории.
● Обеспечивать защиту союзникам.
При игре в данном стиле, Вам придётся очень сильно ориентироваться на каждый
вражеский ход. Первым, что необходимо сделать, играя в экономику, это
убедиться, что Ваш набор персонажей, может оказывать вышеперечисленные
пункты. Если всё хорошо, то теперь необходимо следить за противником. Если он
играет в атаку или наскоки, то срочно меняйте направление стратегии в защиту.
Если же враг играет в защиту, то Вы можете продолжать. Невозможно с точностью
до действия описать стратегию экономики, поскольку слишком много зависит от
вражеских действий. Поэтому, ниже будет приведено лишь несколько примеров и
советов в игре в данном стиле.
Всё, что Вам необходимо сделать, это убить двух персонажей врага. Поскольку он
играет в защиту, он направит своих воинов к Оружейной. Там Вы и сразитесь.
Уничтожьте противника. Захватите зону Оружейной. Вероятнее всего, враг
направит своё подкрепление к ней, поскольку для него, как для игрока защиты, это
наиболее важная стратегическая позиция. Если всё идёт хорошо и к Вам идёт один
враг, в то время как Вы не сильно пострадали после битвы с первым персонажем –
усильте урон, либо купите броню (рекомендовано, если второй враг наносит физ.
или тех. урон). Но скорее всего, Вас сильно потрепало. Так что отдайте врагу зону
Оружейной. Сейчас Вам важнее, не давать врагу получить золото за Вашу смерть.
Следовательно, выводите на середину поля исключительно танков, либо
персонажей с высоким показателем HP. Теперь, когда вы отдали один из магазинов
врагу, переключитесь на Лабораторию. Опять таки, Вам не нужна Лаборатория, как
место закупки (хотя, безусловно, Вы можете закупиться для битвы со вторым
врагом там). Если враг не хочет атаковать Вас и сидит в своей зоне, у Вас есть
время для перемещения своих персонажей к середине поля. Имейте ввиду, при
игре в экономику, Вы должны всегда иметь возле магического магазина хотя бы
двух персонажей. Теперь, если Вам всё же удалось уничтожить двух противников и
у Вашей команды есть 1000 золота, всё что Вам остаётся это грамотно закупиться
на Вашего танка/персонажа с наивысшим показателем лимита ХП. Ниже приведены
рекомендованные связки предметов на 1000 золота:
1. Изумруд времени, Уроборос. Такая связка отлично подойдёт персонажам с
низкой ценой на способности. Например, Минотавр. Активная способность
Изумруда времени будет сбрасывать цену с Уробороса, что позволит Вашему
персонажу быстро восстанавливаться после тяжелой битвы. Аналогом этойсвязки
может быть: Изумруд времени, Сумеречный плащ.
2. Корона Ра, Перчатка повышенного урона, Зелье восстановления/Свиток
телепортации. Эта связка будет идеальна для персонажа с высокими
показателями ХП и ловкости, но низкими показателями урона. Например,
Саламандра.
3. Сапоги света, Ртутные сапоги, Свиток телепортации. Эта связка делает
персонажа, если не самым быстрым в игре, то одним из быстрейших. Даже Гигант
с такими предметами будет перемещаться с ловкостью 8. А активная способность
ртутных сапог позволяет увеличивать эту ловкость в 2 раза. На крайний случай
есть свиток телепортации, но с такой связкой, любой персонаж сможет пробежать
до вражеской базы за 1-2 хода.
Теперь, когда Вы смогли закупиться на живучем персонаже и не отдать ни единицы
золота противнику, Вы находитесь в огромном преимуществе, и всё что Вам
остаётся сделать, это грамотно этим преимуществом воспользоваться.
<subtitle>Наскоки.</subtitle>
Наскоки – это смесь двух предыдущих тактик. Конкретно, Атаки и Экономики.
Основной смысл – точечное уничтожение вражеских персонажей. Наскоки никогда
не является основной тактикой боя и скорее нужна, как спасательный круг.
Наскоки идеальная тактика, если у Вас нет полноценной связки персонажей.
Обычно её используют против Атаки, но это зависит от того, как именно будет
развиваться атака. Если противник смог застать Вас врасплох своей плотной
атакой, скорее перестройтесь в защиту и уберите всех персонажей с вражеской
половины карты к центру Вашей. В начале игры, оцените вражеских и своих
персонажей. Если у Вас есть хотя бы два быстрых (6-7 ловкости) персонажа, а у
врага максимум один маг, можете смело идти в бой. Вся суть Наскоков, чтобы
выполнять резкие атаки на персонажей пытающихся покинуть поле боя, или
выполнить контратаку. Таким образом 4-5 персонажей должны находится у
границы с вражеской территорией, на дальности одного перемещения до
предполагаемой цели. Возможно, увидев это, противник ошибочно предположит,
что Вы играете в Атаку и перестроится в Защиту. Это даст Вам некоторое
количество ходов на подготовку к Наскокам. Ограничьте проход противников на
Вашу территорию с помощью стен, башен лучников, турелей и т.д. Постарайтесь
закрыть как можно больше клеток границы. Теперь, если Вы закрыли хотя бы
половину или треть, Вы можете покинуть свой пост у границы за одним-двумя
персонажами. Они и будут исполнять роль главных атакующих. Если противник на
этом этапе перешёл в глухую защиту, у Вас будет преимущество, поскольку Вы
подготовились быстрее. Если же он будет переходить в атаку, у Вас также будет
преимущество, поскольку Вы подготовились быстрее. Если Вам повезло с
территорией, и Вам попалась Лаборатория, то разбавьте глухую защиту
противника зельем отравления. При атаке оно тоже может пригодиться, поэтому,
хоть и не приоритетно, захватите Лабораторию. Не приоритетно, потому что у
противника Лаборатория будет в приоритете, ведь он играет в Защиту. Таким
образом, эта тактика заканчивается на моменте создания барьера в центре карты.
После этого, Вы уже сами решаете, играть Вам в защиту, что позволяет барьер,
или же в атаку, для чего тоже пригодится барьер.
<title>Судейство</title>
Из-за большого количества событий происходящих в игре одновременно и
некоторых сложностей работы с механикой крипов, в официальных (таких, которые
играются строго по официальным правилам) партиях Сайкйонг Родус
рекомендуется играть с судьей.
Судья в Сайкйонг Родус это словно компьютер, удерживающий в памяти, или на
листе, большое количество информации о перезарядках способностей,
характеристиках персонажей и прочем. Это невероятно важная роль, которую за
отсутствием судьи, часто приходится брать на себя одному из игроков. И хотя
кажется, что ничего страшного в том, что игрок будет судить партию нет, на самом
же деле игрок редко когда может судить партию беспристрастно, иногда завышая
количество пройденных с момента использования способности ходов, или
незаметно передвигая персонажей ближе к магазину. Судья же беспристрастен, он
не помогает ни одному из игроков и с точностью отвечает на все вопросы
касающиеся чисел, ведь именно для этого он и следит за игрой.
Чтобы стать судьей Сайкйонг Родус необходимо досконально ознакомиться с
этими правилами, зная каждый их аспект. Судье необходимо знать все о
персонажах Сайкйонг Родус, как минимум тех, которыми играют в той или иной
партии. Также, следует изучить все товары магического магазина для того, чтобы
мочь подсказать игрокам интересующую их информацию.
<subtitle>Общие советы по судейству.</subtitle>
Судье необходимо постоянно следить за большим количеством чисел, но вот
несколько аспектов в Сайкйонг Родус за которые также не следует забывать:
● Игроки не могут атаковать заклинаниями с типом точка через персонажей, а
только по ближайшему на линии огня. Тоже самое и со стенами.
● После покупки, постройки сначала идут в инвентарь, а после этого, действием,
могут быть возведены на поле.
● Зоны области способностей магов начинаются на расстоянии от 1 до их
дальности. То есть, маги могут призывать свои способности с типом область не
только вокруг себя, но еще и на расстоянии.
● Действия положительных и нейтральных эффектов, наложенных персонажем на
самого себя, могут быть прекращены действием.
● Если персонаж активирует элитры на стене, его высота будет не 2, а 3. Однако,
при контролируемом падении с такой высоты, он все равно не получит урона.
● Подняться на высоту +1 это действие (если это возможно), а спуститься вниз -
перемещение.
● Страх и притягивание по области так же как и остальные области, могут
притягивать и пугать сквозь стены.
● После покупки предмета в лаборатории или оружейной, этот магазин уходит в
перезарядку на 6 следующих ходов для всех персонажей кто принял участие в
покупке.
● Телепортация в красный квадрат невозможна, но луч с перемещением возможен.
● Промах от кустов не учитывается, если два сражающихся персонажа стоят по
разным сторонам кустов.
● Эффект от зоны накладывается сразу после того как игрок завел туда своего
персонажа и завершил свой ход на ней.
Начало официальной партии.
Для проведения официальной партии Сайкйонг Родус необходимо придерживаться
определенного ритуала раздачи карточек персонажа.
Судья берет колоду, состоящую из всех доступных персонажей Сайкйонг Родус.
Перемешивает ее и кладет лицевой стороной вниз так, чтобы игроки не могли знать
какой на карточке персонаж. Затем, первый игрок кидает кости (это может быть
20-гранник, либо несколько 6-гранников). После броска, судья отсчитывает
выпавшее количество от колоды и выдает карточку из-под среза колоды. Затем
следующий игрок кидает кости и так далее по очереди пока у персонажей не будет
по 5 персонажей.
После того как персонажи розданы, игроки могут сбросить персонажей. Они могут
сбросить от 0 до 5 персонажей. После этого они бросают кости оставшееся
количество раз и им выдаются новые карточки, пока у игроков снова не будет по 5
персонажей. Они обязаны играть с этими новыми персонажами и уже не могут
ничего поменять.
После этого игроки договариваются или подкидывают монетку, для того, чтобы
определить, кто ходит первым.
Далее, игроки выставляют фигурки персонажей в «красном квадрате» и партия
начинается.
<subtitle>Партия на 4 игроков</subtitle>
Партия на 4 игроков многим похожа на обычную партию, за некоторыми
исключениями:
1. Игроки, для легкости судейства, ходят либо по часовой, либо против часовой
стрелки.
2. Вражеские постройки, теперь вражеские для всех трех команд.
3. После разрушения базы противника, на баланс команды, нанесшей последний
удар начисляется 1000 золота. Все персонажи его команды исчезают с поля
боя, а его база становится союзной постройкой персонажу, нанесшему
последнюю атаку по базе (Такая база не является еще одной базой команды,
разрушившей ее, а только союзной постройкой, к которой можно
телепортироваться). Такую постройку можно разрушить снова, персонажем
другой команды. В таком случае он не получит никакого золота, но база станет
союзной постройкой уже другой команде. При разрушении базы с
находившимся на ней зельем воскрешения и громоотводом, первое пропадает,
а громоотвод остается на базе.
4. Партия на 4 игроков заканчивается тогда, когда все 4 базы принадлежат
одному игроку, либо пока на поле не останутся персонажи только одной
команды.
<subtitle>Ход Крипов</subtitle>
В официальной партии Сайкйонг Родус, на некоторых картах есть месторождения
крипов. Это месторождение обозначено тремя когтями. Они воскресают на них
каждый пятый ход, начиная с первого. Если за пять ходов крип не был убит, то его
характеристики просто обновляются до полных.
Ход Крипов - это ход после ходов игроков и перед завершением раунда, в который
крипы наносят урон по каждому кто попал в их зону действия. За один раунд один
крип может ударить только одно существо с наименьшим числом НР (если
одинаково, то случайное).
Крипы различаются в зависимости от карты, однако все имеют стандартные
характеристики:
НР: 200
Урон: 100 (физический)
Мана: 0
Ловкость: 0
Броня: 1
Дальность: 2
Крипы являются нейтральными постройками, поэтому способности и предметы с
типом область, а также другие постройки не могут наносить им урон. За убийство
крипа, команда, нанесшая последний удар, получает на общий баланс 100 золота.
<title>Послесловие</title>
Сайкйонг Родус это крайне комплексная игра, в которой каждый может найти для
себя что-то, что приносит удовольствие, будь то победа за любимого персонажа,
либо застройка карты стенами и шахтами. Команда разработки Сайкйонг Родус
желает множества побед и успехов на поле сражения.
Удачной игры!`;